# Практическая работа по уроку "Организация программ и методы строк.

my_string = input("Введите текст: ")
print (len(my_string))                          # Вывод длины введенного текста
print (my_string.upper())                       # Вывод текста в верхнем регистре
print (my_string.lower())                       # Вывод текста в нижнем регистре
print (my_string.replace(' ', ''))              # Удаление в тексте всех пробелов
print (my_string[0])                            # Вывод первого символа из введенного текста
print (my_string[-1])                           # Вывод последнего символа из введенного текста
